import React from "react";

function main() {
  return (
    <main className=" w-full h-full min-h-[100vh] flex items-start justify-center">
      <div className=" h-full w-full max-w-[1120px] items-center justify-center min-h-[100vh] mt-10">
        <h1 className=" text-4xl font-bold">
          Добро пожаловать на мой проект для демонстрации своих возможностей
        </h1>
        <p className=" mt-10">
          Здравствуйте! Меня зовут Кайрат, и я Frontend разработчик с большой
          страстью к созданию красивых и функциональных веб-приложений. Моя
          история началась несколько лет назад, когда я впервые увидел
          волшебство возможностей Frontend-разработки. С тех пор я преодолел
          долгий путь, чтобы стать опытным специалистом в этой области.
          <br />
          <br /> Мое увлечение веб-разработкой началось с изучения HTML, CSS и
          JavaScript. С тех пор я активно следил за развитием технологий и
          фреймворков, чтобы всегда быть в курсе последних тенденций. Моя цель -
          создавать интерфейсы, которые не только красивы, но и максимально
          удобны для пользователей.
          <br />
          <br />
          Один из моих сильных навыков - это адаптивная вёрстка.
          <br />Я уделяю особое внимание тому, чтобы мои проекты отлично
          выглядели и работали на различных устройствах, будь то десктоп,
          планшет или мобильный телефон. Моя цель - создавать интерфейсы,
          которые легко воспринимать и использовать, независимо от размера
          экрана.
          <br />
          <br />
          Я также имею опыт работы с различными библиотеками и фреймворками,
          такими как React, Angular и Vue.js. Эти инструменты позволяют мне
          ускорить процесс разработки и создавать более масштабируемые
          приложения. На моем сайте вы можете найти примеры моих проектов,
          которые я разработал на протяжении моей карьеры. Они включают в себя
          разнообразные веб-приложения, начиная от интернет-магазинов и
          лендингов до веб-приложений с использованием API сторонних сервисов.
          Когда я не занят кодированием, я стараюсь расширить свой кругозор,
          изучая новые языки программирования и технологии.
          <br />
          <br />Я также ценю дизайн и стараюсь улучшить свои навыки в этой
          области, чтобы создавать ещё более привлекательные веб-приложения.
          Буду рад видеть вас на моем сайте и обсудить возможное сотрудничество.
          Не стесняйтесь связаться со мной, если у вас есть какие-либо вопросы
          или предложения. Спасибо за внимание!
          <br />
          <br />
          {/* <b>PS. Текст сгенерирован на OpenAI, ChatGPT-3</b> */}
        </p>
      </div>
    </main>
  );
}

export default main;
